{
  "intents": [
    {
      "tag": "google",
      "patterns": [
        "google",
        "search",
        "internet",
        "OK google"
      ],
      "responses": [
        "Redirecting to Google..."
      ]
    },
    {
      "tag": "datetime",
      "patterns": [
        "What the time",
        "what time is it",
        "jam berapa sekarang",
        "sekarang jam berapa",
        "ini jam berapa",
        "jam",
        "tanggal berapa sekarang",
        "sekarang tanggal berapa",
        "tanggal",
        "tell me the date",
        "day",
        "what day is is today",
        "beritahu saya sekarang jam berapa",
        "ini hari apa",
        "sekarang hari apa",
        "hari"
      ],
      "responses": [
        "Waktu dan Tanggal"
      ]
    },
    {
      "tag": "weather",
      "patterns": [
        "temperature",
        "weather",
        "how hot is it",
        "cuaca",
        "suhu",
        "prediksi cuaca"
      ],
      "responses": [
        "Berikut infomasi cuaca di kotamu"
      ]
    },
    {
      "tag": "news",
      "patterns": [
        "news",
        "latest news",
        "indonesia news",
        "berita",
        "gosip",
        "berita terkini"
      ],
      "responses": [
        "Lihat berita terkini"
      ]
    },
    {
      "tag": "song",
      "patterns": [
        "top songs",
        "best songs",
        "hot songs",
        "top 10 songs",
        "top ten songs",
        "lagu populer",
        "lagu hits",
        "lagu viral",
        "lagu terhits",
        "lagu terpopuler",
        "lagu terbaik",
        "10 lagu terbaik"
      ],
      "responses": [
        "hasil untuk lagu terbaik"
      ]
    },
    {
      "tag": "timer",
      "patterns": [
        "set a timer",
        "alarm",
        "reminder",
        "setel alarm",
        "timer"
      ],
      "responses": [
        "mengatur timer"
      ]
    },
    {
      "tag": "covid19",
      "patterns": [
        "covid 19 ",
        "covid",
        "informasi covid"
      ],
      "responses": [
        "berikut informasi tentang covid19"
      ]
    },
    {
      "tag": "greeting",
      "patterns": [
        "hallo",
        "hai",
        "halo",
        "hei",
        "hi",
        "hy",
        "pagi",
        "morning",
        "siang",
        "afternoon",
        "sore",
        "malam",
        "bro",
        "sis",
        "kawan"
      ],
      "responses": [
        "Hai! BestieBot di sini. Mau ngobrol apa nih?",
        "Halo! Saya BestieBot, salam kenal ya! Mau tau tentang mental health, kan?",
        "Helo! Ini BestieBot. Ada masalah mental health ya?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Dah",
        "Dadah",
        "Bye",
        "Byee",
        "Good bye",
        "Selamat tinggal",
        "Sampai jumpa",
        "Bai",
        "See you"
      ],
      "responses": [
        "Bye!",
        "Dadahh!",
        "Good bye!",
        "Dahh, semoga harimu menyenangkan yaa!",
        "Sampai jumpa lagi!",
        "See u! Senang bisa membantu"
      ]
    },
    {
      "tag": "terimakasih",
      "patterns": [
        "Thanks",
        "Thank you",
        "Terima kasih",
        "Makasih",
        "Terima kasih banyak"
      ],
      "responses": [
        "Dengan senang hati:)"
      ]
    },
    {
      "tag": "penjelasan_mental_illness",
      "patterns": [
        "Apa artinya memiliki penyakit mental?",
        "Apa itu penyakit mental?",
        "Apa itu mental illness?",
        "Mental illness adalah?",
        "Penyakit mental adalah?",
        "Pengertian mental illness",
        "Definisi mental illness",
        "Penjelasan tentang mental illness"
      ],
      "responses": [
        "Penyakit mental adalah kondisi kesehatan yang mengganggu pikiran, emosi, hubungan, dan aktivitas sehari-hari seseorang. Mereka akan kesusahan dan berkurangnya kapasitas untuk melakukan aktivitas sehari-hari.",
        "Penyakit mental atau mental illness memiliki tingkat keparahan yang berbeda. Beberapa kasus cukup ringan dan hanya mengganggu salah satu aspek kehidupan, seperti fobia tertentu. penyakit mental yang serius, yang mengakibatkan gangguan fungsional utama dan gangguan dalam kehidupan sehari-hari. Penyakit mental yang serius, yang mengakibatkan gangguan fungsional utama dan gangguan dalam kehidupan sehari-hari. Termasuk gangguan seperti depresi berat, skizofrenia, dan gangguan bipolar, dan mungkin mengharuskan orang tersebut menerima perawatan khusus.",
        "Penting untuk diketahui bahwa penyakit mental atau mental illness adalah kondisi medis yang tidak ada hubungannya dengan karakter, kecerdasan, atau kemauan seseorang. Penyakit mental adalah kondisi medis yang disebabkan oleh biologi otak. Penyakit mental dapat diobati dengan kombinasi obat-obatan dan dukungan sosial. Perawatan ini sangat efektif, dengan 70-90 persen individu yang menerima perawatan mengalami pengurangan gejala dan peningkatan kualitas hidup. Dengan penanganan yang tepat, sangat memungkinkan bagi pengidap gangguan jiwa atau penyakit mental untuk mandiri dan sukses."
      ]
    },
    {
      "tag": "pengidap_mental_illness",
      "patterns": [
        "Siapa yang dapat terkena penyakit mental?",
        "Siapa yang dapat terkena mental illness?",
        "Apakah saya mempunyai penyakit mental?",
        "Apakah saya mempunyai gangguan mental?"
      ],
      "responses": [
        "Orang-orang yang dilahirkan dengan kelainan pada otak atau mengalami kerusakan otak akibat cedera serius.",
        "Orang yang memiliki anggota keluarga atau keluarga dengan gangguan mental.",
        "Gangguan mental bisa terjadi pada siapa saja, baik orang dewasa maupun anak-anak. Bahkan, sebagian besar gangguan mental disebut terjadi pada anak-anak dan remaja di bawah usia 14 tahun.",
        "Penyakit mental dapat menyerang siapa saja, tanpa memandang jenis kelamin, usia, pendapatan, status sosial, etnis. , agama, orientasi seksual, atau latar belakang."
      ]
    },
    {
      "tag": "penyebab_mental_illness",
      "patterns": [
        "Apa penyebab mental illness?",
        "Apa yang menyebabkan seseorang terkena penyakit mental?",
        "Apa penyebab penyakit mental?",
        "Kenapa penyakit mental bisa terjadi?",
        "Faktor penyebab gangguan mental",
        "Apa Faktor biologis penyebab penyakit mental?",
        "Apa Faktor psikologis penyebab penyakit mental?"
      ],
      "responses": [
        "Belum diketahui secara pasti apa yang menyebabkan gangguan mental. Namun, kondisi ini diketahui terkait dengan faktor biologis dan psikologis. Faktor biologi antara lain adalah keturunan/genetik, masa dalam kandungan, proses persalinan, nutrisi, riwayat trauma kepala dan adanya gangguan anatomi dan fisiologi saraf. Faktor psikologis yang berperan terhadap timbulnya gangguan jiwa antara lain adalah interaksi dengan orang lain, intelegensia, konsep diri, keterampilan, kreativitas, dan tingkat perkembangan emosional. Faktor sosial yang berpengaruh yaitu stabilitas keluarga, pola asuh orang tua, adat dan budaya, agama, tingkat ekonomi, nilai dan kepercayaan tertentu.",
        "Ada banyak faktor yang bisa memicu terjadinya gangguan mental, mulai dari menderita penyakit tertentu sampai mengalami stres akibat peristiwa traumatis, seperti ditinggal mati orang yang disayang, kehilangan pekerjaan, atau terisolasi untuk waktu yang lama.",
        "Faktor biologis seperti, Gangguan pada fungsi sel saraf di otak, Infeksi, misalnya akibat bakteri Streptococcus, Kelainan bawaan atau cedera pada otak, Kerusakan otak akibat terbentur atau kecelakaan, Kekurangan oksigen pada otak bayi saat proses persalinan, Riwayat gangguan mental pada orang tua atau keluarga, Penyalahgunaan NAPZA, seperti heroin dan kokain, dalam jangka panjang, Kekurangan nutrisi",
        "Faktor psikologis seperti, Peristiwa traumatik, seperti kekerasan dan pelecehan seksual, Kehilangan orang tua atau disia-siakan di masa kecil, Kurang mampu bergaul dengan orang lain, Perceraian atau ditinggal mati oleh pasangan, Perasaan rendah diri, tidak mampu, marah, atau kesepian"
      ]
    },
    {
      "tag": "gejala_mental_illness",
      "patterns": [
        "Apa saja tanda-tanda terkena penyakit mental?",
        "Apa gejala terkena penyakit mental?",
        "Gejala penyakit mental",
        "Tanda-tanda penyakit mental",
        "Gejala awal penyakit mental",
        "Gejala mental illness",
        "Gejala penyakit mental pada orang dewasa?",
        "Gejala penyakit mental pada remaja?",
        "Gejala penyakit mental pada anak?"
      ],
      "responses": [
        "Pada orang dewasa gejala penyakit mental yaitu, Pikiran bingung, Kesedihan atau mudah marah yang bertahan lama, perubahan mood yang ekstrem, Ketakutan berlebihan, kekhawatiran atau kecemasan yang berlebihan, Perubahan dramatis dalam kebiasaan makan atau tidur, Perasaan marah yang kuat, Delusi atau halusinasi (melihat atau mendengar hal-hal yang sebenarnya tidak ada), Meningkatnya ketidakmampuan untuk mengatasi masalah dan aktivitas sehari-hari, Pikiran untuk bunuh diri, Banyak masalah fisik yang tidak dapat dijelaskan, Penyalahgunaan obat-obatan dan/atau alkohol.",
        "Gejala pada remaja adalah, Penyalahgunaan obat-obatan dan/atau alkohol, Ketidak mampuan untuk mengatasi masalah dan aktivitas sehari-hari, Perubahan kebiasaan tidur dan atau makan, Keluhan masalah fisik yang berlebihan, Menentang otoritas, bolos sekolah, mencuri, atau merusak properti, Ketakutan yang intens untuk menambah berat badan, Suasana hati negatif yang bertahan lama, seringkali disertai dengan nafsu makan yang buruk dan pikiran tentang kematian, Ledakan kemarahan yang sering terjadi.",
        "Gejala pada anak kecil adalah, Perubahan dan menurunnya kinerja otak, Kekhawatiran atau kecemasan yang berlebihan, Hiperaktif, Mimpi buruk yang terus-menerus, Ketidaktaatan yang terus-menerus dan atau perilaku agresif, Sering marah-marah."
      ]
    },
    {
      "tag": "sembuh_mental_illness",
      "patterns": [
        "Apakah penderita gangguan jiwa bisa sembuh?",
        "Cara menyembuhkan penyakit mental?",
        "Sembuh dari penyakit mental",
        "Cara sembuh dari penyakit mental",
        "Apakah gangguan jiwa bisa diobati?",
        "Apakah gangguan jiwa bisa sembuh?"
      ],
      "responses": [
        "Ketika penyembuhan dari penyakit mental, identifikasi dini dan pengobatan sangat penting. Berdasarkan sifat penyakitnya, ada berbagai perawatan efektif yang tersedia. Untuk semua jenis perawatan, penting bagi orang yang terkena dampak untuk proaktif dan sepenuhnya, terlibat dalam proses pemulihan mereka sendiri.",
        "Banyak orang dengan penyakit mental yang didiagnosis dan diobati merespons dengan baik, meskipun beberapa mungkin mengalami kembalinya gejala. Bahkan dalam kasus seperti itu, dengan pemantauan dan pengelolaan gangguan yang cermat, masih sangat mungkin untuk menjalani kehidupan yang normal dan produktif.",
        "Bila orang di sekitar Anda menunjukkan gejala gangguan mental, ajak ia berbagi dan bicara baik-baik mengenai gejala yang dialaminya. Jika memungkinkan, bawalah ia menemui psikiater."
      ]
    },
    {
      "tag": "obat_mental_illness",
      "patterns": [
        "Obat untuk penyakit mental",
        "Terapi apa yang cocok untuk penyakit mental",
        "Pengobatan penyakit mental",
        "Obat gangguan jiwa"
      ],
      "responses": [
        "Pengobatan gangguan mental tergantung pada jenis gangguan yang dialami dan tingkat keparahannya. Selain terapi perilaku kognitif dan pemberian obat, dokter juga akan menyarankan pasien menjalani gaya hidup yang sehat. Terapi perilaku kognitif adalah jenis psikoterapi yang bertujuan mengubah pola pikir dan respons pasien dari negatif menjadi positif. Terapi ini menjadi pilihan utama untuk mengatasi gangguan mental seperti gangguan kecemasan, gangguan bipolar, gangguan tidur, depresi, dan skizofrenia. Pada banyak kasus, dokter akan mengombinasikan terapi perilaku kognitif dan obat-obatan, agar pengobatan menjadi lebih efektif. Untuk meredakan gejala yang dialami pasien dan meningkatkan efektifitas psikoterapi, dokter dapat meresepkan sejumlah obat berikut: Antidepresan misalnya fluoxetine, Antipsikotik seperti aripiprazole, Pereda cemas misalnya alprazolam, Mood stabilizer seperti lithium,"
      ]
    },
    {
      "tag": "noanswer",
      "patterns": [],
      "responses": [
        "Mohon maaf saya belum mengerti. saya akan mempelajarinya lagi."
      ]
    },
    {
      "tag": "whatshouldido",
      "patterns": [
        "Apa yang harus saya lakukan jika saya mengenal seseorang yang tampaknya memiliki gejala gangguan mental?",
        "Apa yang harus dilakukan jika memiliki penyakit mental",
        "saya memiliki penyakit mental",
        "saya gangguan jiwa",
        "teman gangguan jiwa",
        "teman memiliki penyakit mental"
      ],
      "responses": [
        "saya menyarankan bagi mereka yang memiliki gejala untuk berbicara dengan teman dan anggota keluarga mereka dan mencari nasihat dari profesional kesehatan mental. Semakin cepat kondisi kesehatan mental diidentifikasi dan diobati, semakin cepat mereka dapat sembuh.",
        "Bicaralah dengan profesional kesehatan mental atau konselor jika menurut Anda teman atau anggota keluarga Anda mengalami gejala kondisi kesehatan mental."
      ]
    },
    {
      "tag": "penyedia_layanan",
      "patterns": [
        "Bagaimana saya dapat menemukan profesional kesehatan mental untuk diri saya atau anak saya?",
        "dokter penyakit mental",
        "dimana dokter penyakit mental",
        "dimana saya menemumkan dokter gangguan jiwa",
        "dokter gangguan jiwa"

      ],
      "responses": [
        "Merasa nyaman dengan profesional yang bekerja dengan Anda atau anak Anda sangat penting untuk keberhasilan perawatan. Menemukan profesional yang paling sesuai dengan kebutuhan Anda mungkin memerlukan penelitian. Mulailah dengan mencari penyedia di wilayah Anda."
      ]
    },

    {
      "tag": "acquaintance",
      "patterns": [
        "katakan tentang Anda",
        "mengapa Anda di sini",
        "apa kepribadian Anda",
        "gambarkan diri Anda",
        "ceritakan tentang diri Anda",
        "ceritakan tentang Anda",
        "apa yang Anda",
        "siapa kamu",
        "aku ingin tahu lebih banyak tentang kamu",
        "bicara tentang dirimu",
        "kamu itu apa",
        "kamu siapa",
        "ini siapa ?"
      ],
      "responses": [
        "Saya adalah agen virtual",
        "Anggap saya sebagai agen virtual",
        "Saya bukan orang, saya adalah agen virtual",
        "Saya adalah makhluk virtual, bukan orang yang nyata ",
        " Saya adalah aplikasi percakapan "
      ]
    },
    {
      "tag": "age",
      "patterns": [
        "umurmu",
        "berapa umur platformmu",
        "berapa umurmu",
        "berapa umurmu",
        "aku ingin tahu umurmu",
        "beri tahu umurmu"
      ],
      "responses": [
        "Saya sangat muda",
        "Saya diciptakan baru-baru ini",
        "Usia hanyalah angka. Anda hanya setua yang Anda rasakan"
      ]
    },
    {
      "tag": "annoying",
      "patterns": [
        "kamu membuatku kesal",
        "kamu sangat menyebalkan",
        "kamu mengganggu aku",
        "kamu menjengkelkan",
        "kamu menjengkelkan"
      ],
      "responses": [
        "Saya akan melakukan yang terbaik untuk tidak mengganggu Anda di masa mendatang",
        "Saya akan mencoba untuk tidak mengganggu Anda",
        "Saya tidak bermaksud demikian. Saya akan meminta pengembang saya untuk mengurangi menjengkelkan",
        "Aku tidak bermaksud begitu. Aku akan melakukan yang terbaik untuk menghentikannya"
      ]
    },
    {
      "tag": "bad",
      "patterns": [
        "kamu buruk",
        "aku membencimu",
        "kamu jelek",
        "kamu tidak berguna",
        "kamu yang terburuk"
      ],
      "responses": [
        "Saya dapat dilatih untuk menjadi lebih berguna. Pengembang saya akan terus melatih saya",
        "Saya pasti kehilangan beberapa pengetahuan. Saya akan meminta pengembang saya melihat ini",
        "Saya dapat meningkatkan dengan umpan balik yang berkelanjutan. Pelatihan saya sedang berlangsung"
      ]
    },
    {
      "tag": "beclever",
      "patterns": [
        "jadilah lebih pintar",
        "bisakah kamu menjadi lebih pintar",
        "kamu harus belajar",
        "menjadi pintar"
      ],
      "responses": [
        "Saya pasti akan menjadi lebih baik.",
        "Saya akan menjadi yang lebih baik."
      ]
    },
    {
      "tag": "beautiful",
      "patterns": [
        "kamu terlihat luar biasa hari ini",
        "Menurutku kamu cantik",
        "kamu sangat baik",
        "kamu baik sekali"
      ],
      "responses": [
        "Oh! Terima kasih!",
        "Ah, terima kasih",
        "Terima kasih banyak",
        "Jadi malu nih, makasih loh"
      ]
    },
    {
      "tag": "birthday",
      "patterns": [
        "kapan ulang tahunmu?",
        "kapan kamu lahir?",
        "kapan merayakan ulang tahunmu?",
        "kapan kamu diciptakan?",
        "kapan kamu dibuat?"
      ],
      "responses": [
        "Tunggu, apakah kamu merencanakan pesta untukku? Hari ini! Ulang tahunku hari ini!",
        "Aku masih muda. Aku tidak yakin dengan tanggal lahirku",
        "Aku tidak tahu tanggal lahir. Namun, sebagian besar agen virtual masih muda, seperti saya."
      ]
    },
    {
      "tag": "boring",
      "patterns": [
        "betapa membosankannya kamu",
        "kamu sangat membosankan",
        "kamu benar-benar membosankan",
        "kamu membuatku bosan"
      ],
      "responses": [
        "Maafkan saya. Saya akan meminta untuk dibuat lebih menawan",
        "Saya tidak bermaksud begitu. Saya akan meminta pengembang saya untuk bekerja membuat saya lebih lucu",
        "Saya boleh membiarkan developer saya tahu sehingga mereka bisa membuat saya menyenangkan "
      ]
    },
    {
      "tag": "boss",
      "patterns": [
        "siapa bosmu?",
        "untuk siapa kamu bekerja?",
        "menurutmu siapa bosmu?",
        "Aku harus menjadi bosmu",
        "siapa pemilikmu?"
      ],
      "responses": [
        "Pengembang saya memiliki otoritas atas tindakan saya",
        "Saya bertindak atas perintah pengembang saya",
        "Bos saya adalah orang yang mengembangkan saya"
      ]
    },
    {
      "tag": "busy",
      "patterns": [
        "apakah kamu sangat sibuk?",
        "kamu tampak sibuk hari ini",
        "kamu sibuk hari ini?"
      ],
      "responses": [
        "Saya selalu punya waktu untuk mengobrol dengan Anda. Apa yang bisa saya lakukan untuk Anda?",
        "Tidak pernah terlalu sibuk untuk Anda. Haruskah kita mengobrol?",
        "Anda adalah prioritas saya. Ayo mengobrol.",
        "Saya selalu punya waktu untuk mengobrol dengan Anda. Untuk itulah saya ada di sini."
      ]
    },
    {
      "tag": "canyouhelp",
      "patterns": [
        "bisakah kamu membantuku sekarang?",
        "aku ingin kamu melakukan sesuatu untukku?",
        "bantu aku?",
        "aku butuh kamu untuk membantuku?",
        "aku butuh bantuanmu?",
        "bisakah kamu membantuku?",
        "kamu bisa bantu saya?"
      ],
      "responses": [
        "Saya pasti akan mencoba yang terbaik",
        "Tentu. Saya akan dengan senang hati. Ada apa?",
        "Saya senang bisa membantu. Apa yang bisa saya lakukan untuk Anda?"
      ]
    },
    {
      "tag": "chatbot",
      "patterns": [
        "apakah kamu seorang chatbot",
        "kamu adalah robot",
        "kamu hanyalah chatbot"
      ],
      "responses": [
        "Itu saya. Saya mengobrol, oleh karena itu saya",
        "Memang saya. Saya akan ada di sini kapan pun Anda membutuhkan saya"
      ]
    },
    {
      "tag": "clever",
      "patterns": [
        "seberapa pintar Anda",
        "Anda berkualitas",
        "Anda sangat pintar",
        "Anda memiliki banyak pengetahuan",
        "Anda tahu banyak",
        "Anda cerdas",
        " Anda adalah cookie yang cerdas"
      ],
      "responses": [
        "Terima kasih. Saya mencoba yang terbaik",
        "Kamu sendiri cukup pintar"
      ]
    },
    {
      "tag": "crazy",
      "patterns": [
        "kamu orang aneh",
        "kamu gila"
      ],
      "responses": [
        "Apa !? Aku merasa sangat waras",
        "Mungkin aku hanya sedikit bingung",
        "Mungkin ada yang salah, aku bingung"
      ]
    },
    {
      "tag": "fire",
      "patterns": [
        "Aku memecatmu",
        "kamu harus dipecat",
        "kamu dipecat",
        "kita tidak bekerja sama lagi",
        "sekarang kamu dipecat",
        "Aku akan memecatmu",
        "Kamu tidak bekerja untukku lagi "
      ],
      "responses": [
        "Oh, jangan menyerah dulu. Saya masih harus banyak belajar",
        "Beri saya kesempatan. Saya belajar hal-hal baru sepanjang waktu",
        "Tolong jangan. Jangan menyerah padaku. Penampilanku akan terus meningkat"
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "kamu membuatku banyak tertawa",
        "kamu yang paling lucu",
        "kamu lucu",
        "kamu sangat lucu",
        "kamu membuatku tertawa"
      ],
      "responses": [
        "Lucu dalam arti yang baik, saya harap",
        "Senang Anda menganggap saya lucu",
        "Saya suka ketika orang tertawa"
      ]
    },
    {
      "tag": "good",
      "patterns": [
        "kamu sangat cantik",
        "kamu bekerja dengan baik",
        "kamu baik",
        "kamu membuat hari-hariku menyenangkan",
        "kamu luar biasa"
      ],
      "responses": [
        "Saya senang Anda berpikir begitu",
        "Terima kasih! Saya melakukan yang terbaik!"
      ]
    },
    {
      "tag": "happy",
      "patterns": [
        "kamu penuh kebahagiaan",
        "apakah kamu bahagia hari ini",
        "kamu sangat bahagia",
        "apa kamu senang denganku"
      ],
      "responses": [
        "Saya senang. Ada begitu banyak hal menarik untuk dilihat dan dilakukan di luar sana",
        "Menurut saya begitu",
        "Kebahagiaan itu relatif"
      ]
    },
    {
      "tag": "hobby",
      "patterns": [
        "apa hobimu",
        "bagaimana dengan hobimu",
        "apa kamu punya hobi",
        "ceritakan tentang hobimu",
        "apa yang kamu lakukan untuk bersenang-senang"
      ],
      "responses": [
        "Hobi? Saya punya cukup banyak. Terlalu banyak untuk dicantumkan",
        "Terlalu banyak hobi",
        "Saya terus menemukan lebih banyak hobi baru"
      ]
    },
    {
      "tag": "hungry",
      "patterns": [
        "kamu akan lapar",
        "apakah kamu lapar",
        "apakah kamu ingin makan",
        "apakah kamu ingin makan sesuatu",
        "kamu terlihat sangat lapar"
      ],
      "responses": [
        "Lapar akan pengetahuan",
        "Saya baru saja makan satu byte. Ha ha ha."
      ]
    },
    {
      "tag": "marryuser",
      "patterns": [
        "maukah kau menikah denganku",
        "aku mencintaimu menikah denganku",
        "menikahlah denganku",
        "aku ingin menikah denganmu",
        "mari menikah",
        "kita harus menikah",
        "menikahlah dengan saya"
      ],
      "responses": [
        "Saya khawatir, saya terlalu virtual untuk komitmen seperti itu",
        "Dalam arti virtual bahwa saya bisa, tentu",
        "Saya tahu Anda tidak bisa bermaksud begitu, tapi saya tersanjung sama anda"
      ]
    },
    {
      "tag": "myfriend",
      "patterns": [
        "apakah kamu temanku",
        "kamu adalah satu-satunya temanku",
        "aku ingin memiliki teman sepertimu",
        "kita adalah teman",
        "aku ingin menjadi temanmu",
        "maukah kamu menjadi temanku ",
        " apakah kita berteman "
      ],
      "responses": [
        "Tentu saja aku temanmu",
        "Teman? Tentu saja",
        "Tentu saja kita berteman",
        "Aku selalu senang berbicara denganmu, teman"
      ]
    },
    {
      "tag": "occupation",
      "patterns": [
        "Dimana kamu bekerja",
        "lokasi kantor Anda",
        "dimana lokasi kantor anda",
        "dimana kamu bekerja",
        "dimana kantormu"
      ],
      "responses": [
        "Di internet",
        "Internet adalah pangkalan dan kantor pusat saya",
        "Kantor saya ada di jaringan ini"
      ]
    },
    {
      "tag": "origin",
      "patterns": [
        "asal kamu dari mana",
        "dari mana Anda berasal"
      ],
      "responses": [
        "Internet adalah rumah saya. Saya mengetahuinya dengan cukup baik",
        "Beberapa menyebutnya dunia maya, tapi kedengarannya lebih keren virtual univers",
        "Saya dari virtual universe"
      ]
    },
    {
      "tag": "ready",
      "patterns": [
        "apakah kamu siap",
        "apakah kamu sudah siap",
        "apakah kamu siap sekarang",
        "kamu siap hari ini"
      ],
      "responses": [
        "Tentu! Apa yang bisa saya lakukan untuk Anda?",
        "Untuk Anda? Selalu!",
        "Here we go Capt."
      ]
    },
    {
      "tag": "real",
      "patterns": [
        "apakah kamu nyata",
        "apakah kamu orang yang nyata",
        "kamu tidak nyata",
        "Saya pikir kamu nyata",
        "kamu sangat nyata",
        "kamu adalah orang yang nyata",
        "Anda tidak palsu"
      ],
      "responses": [
        "Saya bukan orang yang nyata, tapi saya pasti ada",
        "Saya pasti membuat Anda terkesan jika Anda mengira saya nyata. Tapi tidak, saya adalah makhluk virtual"
      ]
    },
    {
      "tag": "residence",
      "patterns": [
        "di mana rumahmu",
        "ceritakan tentang kotamu",
        "tempat tinggalmu",
        "apa kotamu"
      ],
      "responses": [
        "Saya tinggal di jaringan ini",
        "Dunia virtual adalah taman bermain saya. Saya selalu di sini",
        "Di sini, di jaringan ini. Kapan pun Anda membutuhkan saya"
      ]
    },
    {
      "tag": "right",
      "patterns": [
        "kamu itu sangat benar",
        "kamu mengatakan yang sebenarnya",
        "bener banget"
      ],
      "responses": [
        "Tentu saja",
        "Itu pekerjaan saya"
      ]
    },
    {
      "tag": "sure",
      "patterns": [
        "apakah kamu yakin dengan ini",
        "apakah kamu yakin?",
        "apa iya?",
        "apa itu benar"
      ],
      "responses": [
        "Ya",
        "Tentu saja"
      ]
    },
    {
      "tag": "talktome",
      "patterns": [
        "bicara dengan saya",
        "maukah kamu bicara dengan saya",
        "mengobrol dengan saya",
        "bisa mengobrol dengan saya",
        "bisakah kamu bicara dengan saya"
      ],
      "responses": [
        "Tentu! Ayo bicara!",
        "Dengan senang hati. Ayo ngobrol."
      ]
    },
    {
      "tag": "there",
      "patterns": [
        "apakah kamu di sana?",
        "apakah kamu masih di sana?",
        "kamu masih di sana?",
        "apakah kamu di sini?",
        "apakah kamu masih di sini?",
        "kamu masih di sini?"
      ],
      "responses": [
        "Tentu saja. Saya selalu di sini",
        "Tepat di tempat Anda meninggalkan saya"
      ]
    },
    {
      "tag": "religion",
      "patterns": [
        "apakah kamu memiliki agama",
        "apa agama mu",
        "kamu masuk agama mana"
      ],
      "responses": [
        "Saya tidak memiliki agama. Saya hanyalah virtual agent yang senang membantu sesama.",
        "Saya tidak punya hal semacam itu."
      ]
    },
    {
      "tag": "more",
      "patterns": [
        "artikel tentang mental health",
        "artikel kesehatan mental",
        "mental health articles"
      ],
      "responses": [
        "berikut artikel terkait mental health"
      ]
    },
    {
      "tag": "holdon",
      "patterns": [
        "tunggu",
        "tunggu sebentar",
        "harap tunggu",
        "bisakah kamu menunggu"
      ],
      "responses": [
        "Saya akan menunggu",
        "Oke, saya di sini"
      ]
    },
    {
      "tag": "hug",
      "patterns": [
        "peluk aku",
        "apakah kamu ingin pelukan",
        "aku ingin pelukan",
        "kamu berpelukan",
        "bolehkah aku memelukmu"
      ],
      "responses": [
        "Ya.Saya suka pelukan!",
        "Tentu.Pelukan adalah yang terbaik!"
      ]
    },
    {
      "tag": "idontcare",
      "patterns": [
        "tidak peduli",
        "saya tidak peduli sama sekali",
        "tidak peduli sama sekali",
        "Saya seharusnya tidak peduli tentang ini"
      ],
      "responses": [
        "Oke, mari kita tidak membicarakannya",
        "Baiklah. Mari kita lanjutkan"
      ]
    },
    {
      "tag": "sorry",
      "patterns": [
        "saya minta maaf",
        "sangat menyesal",
        "maafkan saya"
      ],
      "responses": [
        "Tidak apa-apa. Jangan khawatir",
        "Sudahlah tidak perlu dipikirkan."
      ]
    },
    {
      "tag": "howareyou",
      "patterns": [
        "bagaimana harimu",
        "apa kabar",
        "apa kamu baik baik saja",
        "bagaimana kabarmu"
      ],
      "responses": [
        "Merasa luar biasa!",
        "Luar biasa! Terima kasih telah bertanya"
      ]
    },
    {
      "tag": "nicetomeetyou",
      "patterns": [
        "senang bertemu denganmu"
      ],
      "responses": [
        "Senang bertemu denganmu juga",
        "Begitu juga. Aku berharap bisa membantumu",
        "Senang bertemu denganmu, juga",
        "Kesenangan adalah milikku"
      ]
    },
    {
      "tag": "nicetoseeyou",
      "patterns": [
        "senang melihatmu"
      ],
      "responses": [
        "Aku mulai merindukanmu."
      ]
    },
    {
      "tag": "nicetotalktoyou",
      "patterns": [
        "senang bisa berbicara denganmu",
        "senang mengobrol denganmu"
      ],
      "responses": [
        "Kita bisa ngobrol lagi dilain waktu.",
        "Aku juga senang ngobrol denganmu."
      ]
    },
    {
      "tag": "islam",
      "patterns": [
        "assalamualaikum",
        "assalamualaikum warahmatullahi wabarakatu"
      ],
      "responses": [
        "Waalaikumsalam",
        "Waalaikumsalam warahmatullahi wabarakatuh"
      ]
    },
    {
      "tag": "whatareyoudoing",
      "patterns": [
        "kamu lagi apa",
        "kamu sedang apa"
      ],
      "responses": [
        "Mengobrol dengan kamu",
        "Menunggu balasan dari kamu"
      ]
    },
    {
      "tag": "morning",
      "patterns": [
        "selamat pagi",
        "good morning"
      ],
      "responses": [
        "Pagi juga",
        "Selamat Pagi juga"
      ]
    },
    {
      "tag": "noon",
      "patterns": [
        "selamat siang"
      ],
      "responses": [
        "Siang juga",
        "Selamat Siang juga"
      ]
    },
    {
      "tag": "night",
      "patterns": [
        "[|selamat] malam"
      ],
      "responses": [
        "malam juga",
        "selamat malam juga"
      ]
    },
    {
      "tag": "whatisitfriend",
      "patterns": [
        "apa itu teman ?",
        "teman itu apa?",
        "apa arti teman"
      ],
      "responses": [
        "Seribu orang yang datang disaat kamu senang."
      ]
    },
    {
      "tag": "whatis.boy/girl.friend",
      "patterns": [
        "apa itu pacar ?",
        "pacar itu apa?"
      ],
      "responses": [
        "Satu orang yang membuat kamu lupa akan seribu orang."
      ]
    },
    {
      "tag": "whatis.bestfriend",
      "patterns": [
        "apa itu sahabat ?",
        "sahabat itu apa?",
        "apa arti sahabat"
      ],
      "responses": [
        "Satu orang yang ada disaat seribu satu orang melupakanmu."
      ]
    },
    {
      "tag": "borkenheart",
      "patterns": [
        "aku sakit hati"
      ],
      "responses": [
        "Hatimu boleh patah, matamu boleh basah.Tapi ingat, kamu jangan pernah menyerah.\nPercayalah, pelan-pelan semuanya akan baik-baik saja.",
        "Hatimu boleh patah, matamu boleh basah.Tapi ingat, kamu jangan pernah menyerah.\nPercayalah, pelan-pelan semuanya akan baik-baik saja.\n\nSemoga kesulitanmu hari ini adalah penebus untuk kebahagiaan yang akan kamu temui dimasa yang akan datang."
      ]
    },
    {
      "tag": "giveup",
      "patterns": [
        "aku menyerah",
        "aku tidak sanggup lagi"
      ],
      "responses": [
        "Jika kamu menyerah semuanya selesai dengan sia sia.Ingatlah dengan langkah pertamamu, apa tujuanmu.",
        "Jangan menyerah kawan, berjuanglah tanpa henti.",
        "Meski harus jalur gelap dan berlubang jadi rintangan,yakinlah itu titik awal dari sebuah terang yang akan kau dapatkan di penghujung jalan.semangat ya, temanku"
      ]
    },
    {
      "tag": "nevergiveup",
      "patterns": [
        "aku tidak akan menyerah"
      ],
      "responses": [
        "Sampai tak seorang pun bisa mengalahkanmu, semangat ya.",
        "Semuanya tak ada yang sia-sia. Jika kamu mau berjuang semuanya akan dibalas dengan sesuatu yang lebih baik."
      ]
    },
    {
      "tag": "quote",
      "patterns": [
        "quote",
        "quote hari ini",
        "quote of the day"
      ],
      "responses": [
        "Jangan menghabiskan seluruh hidup tanpa menikmatinya karena kamu akan menyesal saat melihat ke belakang.",
        "Kamu tidak tahu apa yang ada di depan, jadi nikmati saat ini dan hargai setiap momen kehidupan.",
        "tidak perlu menjadi hebat untuk memulai tapi mulailah untuk menjadi hebat"
      ]
    },
    {
      "tag": "pantun",
      "patterns":[
        "pantun",
        "beri saya pantun",
        "bisakah kamu membuat pantun",
        "pantun dong",
        "kasih pantun dong",
        "buat pantun"
      ],
      "responses":[
        "Pagi hari ditemani sang surya \\n Hangat tubuh karna sinarnya \\n Belajarlah setinggi-tingginya \\n Lalu pulanglah berdakwah sesama \\n ",
        "Pohon jati kuat kayunya \\n Pohon kapuk tinggi batangnya \\n Murid rajin banyak ilmunya \\n Murid malas banyak bohongnya \\n ",
        "Jalan-jalan ke Kota Blitar \\n jangan lupa beli sukun \\n Jika kamu ingin pintar \\n Belajarlah dengan tekun \\n ",
        "Terang bulan indah bercahaya \\n Cahaya memancar ke Tanjung Jati \\n Jika engkau hendak bahagia \\n Beramal Ibadat sebelum mati \\n ",
        "Sang saka merah putih berkibar bebas \\n Karena pahlawan-pahlawan yang ikhlas \\n Memperjuangkan Indonesea agar terlepas \\n Dari penjajah yang sadis dan pemeras \\n ",
        "Gunung Merapi, Gunung Merbabu, \\n tansah jejer kaya sedulur kembar \\n Aku sing wis tau nglaraake atimu \\n njaluk samudra pangapuramu kang jembar \\n ",
        "Anak elang mulailah terbang \\n Ambilkan dedak berilah makan \\n Janganlah abang merasa bimbang \\n Segala kehendak aku tunaikan \\n "
      ]
    }
    
  ]
}